{
    "# + #": [
        "Emma had # apples, and her friend gave her ## more. How many apples does Emma have now?",
        "John saved $# from his allowance, and he earned $## by doing chores. How much money does John have now?",
        "A farmer collected # eggs from one hen and ## eggs from another. How many eggs did the farmer collect in total?",
        "In a game, Sarah scored # points in the first round and ## points in the second round. How many points did Sarah score in total?",
        "In a game, you earn # points for completing a level and an additional ## points for finding a hidden treasure. How many points did you earn in total?"
    ],
    "# * #": [
        "Sarah bought # packs of pens, with each pack containing ## pens. How many pens did Sarah buy in total?",
        "A farmer has # baskets, and each basket contains ## ripe apples. How many apples does the farmer have in total?",
        "Jenny needs to make # batches of cookies, and each batch requires ## cups of flour. How many cups of flour does Jenny need in total?",
        "There are # boxes, and each box contains ## toy cars. How many toy cars are there in total?",
        "A bookstore received # shipments of books, and each shipment had ## boxes. How many boxes of books did the bookstore receive in total?"
    ],
    "# + # + #": [
        "A chef has # tablespoons of flour, ## tablespoons of egg whites, and needs ### tablespoons of butter to make a cake. How many total tablespoons are needed?",
        "A family has # children, ## adults, and ### pets in their home. How many living beings are in the house in total?",
        "A company has # offices in the United States, ## offices in Europe, and ### offices in Asia. How many total offices does the company have?",
        "A student has # math problems, ## science problems, and ### history problems to solve for homework. How many total problems must the student complete?",
        "A restaurant has # pots, ## pans, and ### spatulas. How much cookware does the restaurant have?"
    ],
    "# * # * #": [
        "A factory produces # boxes per hour, and each box contains ## toys. If the factory operates for ### hours, how many toys are produced in total?",
        "A car travels # miles per gallon and the gas tank holds ## gallons. How many miles can it cover over ### fill-ups?",
        "A team of workers can complete a project in # days working ## hours per day. How many hours would it take to finish ### projects?",
        "Lisa is organizing a fundraising event for her school. She plans to sell boxes of cookies. Each box contains # rows of cookies, with ## cookies in each row. Lisa wants to assemble the boxes in stacks, with ### boxes in each stack. How many cookies will be in a stack of boxes?",
        "A baker has # types of cakes with ## different flavors each. If the baker wants to make a display with ### of each combination, how many total cakes will be in the display?"
    ],
    "# + # + # + #": [
        "A group of friends decided to donate money to a charity. The first friend gave $#, the second friend gave $##, the third friend gave $###, and the fourth friend gave $####. How much money did they donate in total?",
        "A group of friends collects seashells. John finds # seashells, Emily finds ## seashells, David finds ### seashells, and Sarah finds #### seashells. How many seashells did they collect together?",
        "There are # red balloons and ## blue balloons. If ### green balloons are added to the collection, and then #### yellow balloons are added, how many balloons are there in total?",
        "A bookstore sells # fiction books, ## non-fiction books, ### mystery books, and #### science books. How many books are there in the store?",
        "The temperature in a city increases by # degrees Celsius in the morning, then increases by ## degrees Celsius in the afternoon, followed by an increase of ### degrees Celsius in the evening, and finally an increase of #### degrees Celsius at night. What is the total increase in temperature over the day?"
    ],
    "# * # * # * #": [
        "Sarah earned $# for every hour she worked. If she worked ## hours a day, ### days a week, and for #### weeks, how much money did she earn in total?",
        "A classroom has # rows with ## desks in each row. If each desk has ### books on it and there are #### subjects, how many subjects are there total?",
        "A farmer has # fields, each containing ## rows of crops, and each row has ### plants. If each plant yields #### fruits, how many fruits did the farmer harvest in total?",
        "A factory produces # cars per hour. Each car consists of ## major components, and each component requires ### smaller parts. If the factory operates for #### hours, how many smaller parts were used in total?",
        "A box contains # bags, and each bag contains ## books. If each book has ### chapters and each chapter has #### pages, how many pages are there in total?"
    ],
    "# + # + # + # + #": [
        "A marathon runner ran # miles on Monday, ## miles on Tuesday, ### miles on Wednesday, #### miles on Thursday, and ##### miles on Friday. How many miles did the runner cover in total?",
        "The temperature in a town increased by # degrees Celsius on Monday, then by ## degrees on Tuesday, followed by an increase of ### degrees on Wednesday, #### degrees on Thursday, and ##### degrees on Friday. What was the total increase in temperature over the five days?",
        "A group of friends collected # seashells on a beach, found ## more seashells near a reef, discovered ### additional seashells in a tide pool, picked up #### seashells along the shore, and gathered ##### seashells from a hidden cove. How many seashells did the group collect in total?",
        "In a video game, a player earned # points in the first level, ## points in the second level, ### points in the third level, #### points in the fourth level, and ##### points in the fifth level. How many points did the player accumulate across all five levels?",
        "Tim has # apples. He buys ## more apples from the store and later receives ### apples as a gift. If he then picks up #### apples from his friend's orchard and finds ##### apples on the ground, how many apples does Tim have in total?"
    ],
    "# * # * # * # * #": [
        "A farmer has # fields, and each field contains ## rows of crops. Each row has ### plants. If each plant produces #### fruits and each fruit contains ##### seeds, how many seeds does the farmer have in total?",
        "A group of friends decides to plant a garden together. They divide the garden into # sections, and each section has ## rows of plants. Each row contains ### plants, and each plant produces #### flowers. If each flower has ##### petals, how many petals are there in the entire garden?",
        "A shipment of boxes contains # crates. Each crate holds ## cartons, and each carton contains ### packets. Each packet has #### items, and each item weighs ##### grams. What is the total weight of all the items in the shipment in grams?",
        "A bookstore is arranging a display of books. They stack # rows of books on each shelf, and each row contains ## books. Each book has ### chapters, and each chapter consists of #### pages. If each page has ##### paragraphs, how many paragraphs are there in the entire display?",
        "A farmer plants # rows of corn, with ## corn plants in each row. Each corn plant produces ### ears of corn. If every ear of corn has #### rows of kernels and each row has ##### kernels, how many kernels of corn does the farmer harvest in total?"
    ],
    "# + # + # + # + # + #": [
        "Jane wants to buy six different fruits from a store. She picks an apple, an orange, a banana, a pear, a peach, and a plum. If each fruit costs $#, $##, $###, $####, $#####, and $###### respectively, what is the total amount she will spend?",
        "A bakery sells six different types of cookies. The prices of these cookies are $#, $##, $###, $####, $#####, and $###### per dozen. If a customer buys one dozen of each type, what will be the total cost of the cookies?",
        "Sally had # apples, and her friend gave her ## more. Later, she received ### oranges, #### bananas, ##### strawberries, and ###### cherries. How many fruits does Sally have in total?",
        "A group of friends decided to contribute money for a charity. John donated # dollars, Mary gave ## dollars, David contributed ### dollars, Sarah offered #### dollars, Emily added ##### dollars, and Alex donated ###### dollars. How much money did they collect in total?",
        "In a math competition, each correct answer was worth a certain number of points. Mark scored # points in the first round, ## points in the second round, ### points in the third round, #### points in the fourth round, ##### points in the fifth round, and ###### points in the final round. What was Mark's total score in the competition?"
    ],
    "# * # * # * # * # * #": [
        "A bookshelf has # shelves, and each shelf has ## books stacked. Each book has ### chapters, and each chapter has #### pages. If there are ##### lines of text on each page and ###### words in each line, how many words are there in total?",
        "A bakery sells cookies in boxes. Each box contains # trays, and each tray holds ## rows of cookies. Each row consists of ### cookies arranged in a straight line. If each cookie has #### chocolate chips on top, and each chocolate chip is made up of ##### chocolate pieces, and each chocolate piece is divided into ###### small squares, how many small squares of chocolate are there in total?",
        "In a factory, there are # assembly lines. Each assembly line has ## workers, and each worker can assemble ### units per hour. Each unit consists of #### components, and each component requires ##### individual parts. Each part has ###### screws. How many screws are used in total to assemble all the units in the factory in one hour?",
        "A bakery sells cakes in boxes. Each box contains # layers of cake, and each layer has ## slices. Each slice is made up of ### small pieces. Each small piece is decorated with #### chocolate chips. If each chocolate chip is made up of ##### chocolate chunks and each chocolate chunk contains ###### cocoa beans, how many cocoa beans are there in total in a box of cakes?",
        "In a school science fair, six groups are competing with their projects. Each group has a specific number of members. The number of members in each group is as follows: Group A has # members, Group B has ## members, Group C has ### members, Group D has #### members, Group E has ##### members, and Group F has ###### members. If, for each project, a single member of each group is chosen how many unique project groups are there?"
    ]
}
